src/Documents/РемонтОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>РемонтОборудования</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ИсторияСостоянийОборудования</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Оборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Оборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаРемонта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияРемонта</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатРемонта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьРемонта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ITЗаявка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеПослеРемонта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оформил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/ИсторияСостоянийОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ИсторияСостоянийОборудования</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияОборудования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗакрепленоЗа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ITЗаявка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оформил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Оборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Оборудование</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/СостоянияОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СостоянияОборудования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаСкладе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Используется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРемонте</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Списано</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/СтатусыЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыЗаявок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Назначена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетУточнения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетОборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Решена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/РемонтОборудования/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Не ЗначениеЗаполнено(Оформил) Тогда
		Попытка
			Оформил = УправлениеПользователямиСервер.ПолучитьТекущегоСотрудника();
		
		Исключение
			Сообщить("Не удалось определить сотрудника, оформляющего ремонт. " + ОписаниеОшибки());
			Отказ = Истина;
			Возврат;
		КонецПопытки; 
	
		Если Не ЗначениеЗаполнено(Оформил) Тогда
			Сообщить("Пользователь ИБ не связан с активным сотрудником.");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ДатаОкончанияРемонта) Тогда
		Если ДатаОкончанияРемонта < Дата Тогда
			Сообщить("Дата окончания ремонта не может быть раньше даты начала ремонта.");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
	    Если ДатаОкончанияРемонта > ТекущаяДатаСеанса() Тогда
			Сообщить("Дата окончания ремонта не может быть позже текущей даты.");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		Если ПустаяСтрока(СокрЛП(РезультатРемонта)) Тогда
			Сообщить("Не заполнен результат ремонта.");
			Отказ = Истина;
			Возврат;	
		КонецЕсли;  
		
		Если НЕ ЗначениеЗаполнено(СостояниеПослеРемонта) Тогда
			Сообщить("Не указано состояние оборудования после ремонта.");
			Отказ = Истина;
			Возврат;
		КонецЕсли;

		Если СостояниеПослеРемонта = Перечисления.СостоянияОборудования.ВРемонте Тогда
			Сообщить("После завершения ремонта оборудование не может оставаться в состоянии ""В ремонте"".");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(ДатаОкончанияРемонта) И НЕ ПустаяСтрока(СокрЛП(РезультатРемонта)) Тогда	
		Сообщить("Для указанного результата необходимо заполнить дату окончания ремонта.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДатаОкончанияРемонта) И ЗначениеЗаполнено(СостояниеПослеРемонта) Тогда
		Сообщить("Состояние после ремонта можно указывать только при заполненной дате окончания ремонта.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если СтоимостьРемонта < 0 Тогда
		Сообщить("Стоимость ремонта не может быть отрицательной.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения) 
	Если НЕ ЗначениеЗаполнено(Заявка) Тогда
		Сообщить("Не указана связанная заявка.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Оборудование) Тогда
		Сообщить("Не указано оборудование.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Если ПустаяСтрока(СокрЛП(ПричинаРемонта)) Тогда
		Сообщить("Не указана причина ремонта.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Оформил) Тогда
		Сообщить("Не указан сотрудник, оформивший ремонт.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	ДанныеЗаявки = УправлениеОборудованиемСервер.ПолучитьДанныеЗаявкиДляРаботыСОборудованием(Заявка);

	Если ДанныеЗаявки = Неопределено Тогда
		Сообщить("Не удалось получить данные связанной заявки.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Если ДанныеЗаявки.ТекущийСтатус <> Перечисления.СтатусыЗаявок.ОжидаетОборудование Тогда		
		Сообщить("Передача оборудования в ремонт возможна только по заявке в статусе ""Ожидает оборудование"".");			
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ДанныеЗаявки.Оборудование) ИЛИ Оборудование <> ДанныеЗаявки.Оборудование Тогда	
		Сообщить("В ремонт необходимо передать проблемное оборудование, указанное в заявке.");			
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	МоментДоДокумента = Новый Граница(МоментВремени(), ВидГраницы.Исключая);
	ТекущееСостояние = УправлениеОборудованиемСервер.ПолучитьТекущееСостояниеОборудования(Оборудование, МоментДоДокумента, Ссылка);

	Если ТекущееСостояние = Неопределено Тогда
		Сообщить("Не удалось определить текущее состояние оборудования.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если ТекущееСостояние.Состояние <> Перечисления.СостоянияОборудования.Используется Тогда		
		Сообщить("Передать в ремонт можно только оборудование, которое находится в использовании.");		
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Если ТекущееСостояние.ЗакрепленоЗа <> ДанныеЗаявки.Заявитель Тогда
		Сообщить("Оборудование не закреплено за заявителем связанной заявки.");		
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Движения.ИсторияСостоянийОборудования.Записывать = Истина;

	КомментарийНачала = "Передано в ремонт. Причина: " + СокрЛП(ПричинаРемонта);

	Если НЕ ПустаяСтрока(СокрЛП(Комментарий)) Тогда
		КомментарийНачала = КомментарийНачала + " " + СокрЛП(Комментарий);
	КонецЕсли;

	Движение = Движения.ИсторияСостоянийОборудования.Добавить();

	Движение.Период = Дата;
	Движение.Оборудование = Оборудование;
	Движение.Состояние = Перечисления.СостоянияОборудования.ВРемонте;
	Движение.ЗакрепленоЗа = Справочники.Сотрудники.ПустаяСсылка();
	Движение.Заявка = Заявка;
	Движение.Комментарий = КомментарийНачала;
	Движение.Оформил = Оформил;

	Если ЗначениеЗаполнено(ДатаОкончанияРемонта) Тогда

		КомментарийОкончания = "Ремонт завершён. Результат: " + СокрЛП(РезультатРемонта);

		Движение = Движения.ИсторияСостоянийОборудования.Добавить();

		Движение.Период = ДатаОкончанияРемонта;
		Движение.Оборудование = Оборудование;
		Движение.Состояние = СостояниеПослеРемонта;
		Если СостояниеПослеРемонта = Перечисления.СостоянияОборудования.Используется Тогда
			Движение.ЗакрепленоЗа = ТекущееСостояние.ЗакрепленоЗа;
		Иначе
			Движение.ЗакрепленоЗа = Справочники.Сотрудники.ПустаяСсылка();
		КонецЕсли;
		
		Движение.Заявка = Заявка;
		Движение.Комментарий = КомментарийОкончания;
		Движение.Оформил = Оформил;
	КонецЕсли;

КонецПроцедуры
